index.org
#+TITLE: Sam's Emacs
#+AUTHOR: Samuel Wallace
#+OPTIONS:  num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="styles.css" />
#+PROPERTY: header-args:emacs-lisp :tangle more-settings.el :comments no :exports code

* Intro

  This config is mainly for writing a mixture of Org and $\LaTeX$ documents. Version controlling is done through Git.

  This is organized as an Org document for several reasons: One is for readability, another for easy publishing as a webpage, but the main one is to allow other users to build their own configs from. How? Filtering by =TODO= keywords and tags. Want all my keybindings, but none of my LaTeX stuff? You can =org-sparse-tree= or =C-c /= to apply filters and select what you want. At the end of the day, tangle the filtered results.

* General


   We make a run key that gives a menu to different programs you might want a glance at.

#+BEGIN_SRC emacs-lisp
  (defun add-menu-item (key command)
	 (global-set-key (kbd (concat "C-; " key)) command))
  (defun find-init-file () (interactive) (find-file user-init-file))
  (add-menu-item "i" 'find-init-file)
  (add-menu-item "p" 'proced)
  (setq external-pdf-viewer "zathura")
#+END_SRC

  
Let's do a different custom-settings file:

   #+BEGIN_SRC emacs-lisp
     (setq custom-file "~/.emacs.d/custom.el")
     (load-file custom-file)
   #+END_SRC

** Neofetch Start Screen :bling:

   We make a Neofetch start screen with lots of data for a startup screen (and for that sweet karma).

   #+BEGIN_SRC emacs-lisp
     (defun neofetch () (interactive) (async-shell-command "neofetch" "*Neofetch*"))
     (setq inhibit-startup-screen t)
     (neofetch)
   #+END_SRC

* Document Preparation
** IN PROGRESS Pure Latex                                               :TeX:

   We add a function for package load-time settings:
   #+BEGIN_SRC emacs-lisp
     (defun latex-init-settings ()
       (setq TeX-parse-self t)
       (add-to-list 'TeX-command-list
		    '("latexmk lualatex compile" "latexmk -lualatex %s" TeX-run-command nil t))
       (add-to-list 'TeX-command-list
		    '("latexmk lualatex preview" "latexmk -lualatex -pvc -view=none %s" TeX-run-command nil t))
       (add-to-list 'TeX-command-list
		    '("latexindent" "latexindent -w %s" TeX-run-command nil t))
       (setq TeX-view-program-selection '((output-pdf "Okular")))
       (setq cdlatex-math-modify-alist
	     '((98 "\\mathbb" nil t nil nil)
	       (102 "\\mathfrak" nil t nil nil)))
       (setq cdlatex-math-symbol-alist
	     '((120 "\\chi" "\\otimes")
	       (62 "\\geq" "\\geqsim")
	       (60 "\\leq" "\\lesssim"))))
   #+END_SRC

   Let's set a mode hook function:

#+BEGIN_SRC emacs-lisp
     (defun latex-hook ()
       (cdlatex-mode 1)
       (reftex-mode 1)
       (prettify-symbols-mode 1))
 #+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package latex
    :defer t
    :ensure auctex
    :config (latex-init-settings))

  (add-hook 'LaTeX-mode-hook 'latex-hook)
#+END_SRC

*** CANCELLED make minor mode for wrapping text in LaTeX but not math mode text

Decided I didn't mind... probably not worth the effort.

*** CANCELLED Jump to items and sections

    Let's try to write a function that jumps to the previous thing...

    #+BEGIN_SRC emacs-lisp :tangle no
      (defun latex-last-item () (interactive)
	     (isearch-backward "\\item"))
      (defun latex-last-section () (interactive)
	     (isearch-backward "\\.*section"))
      (defun latex-next-item () (interactive)
	     (isearch "\\item"))
      (defun latex-next-section () (interactive)
	     (isearch "\\.*section"))
    #+END_SRC
   
