index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-17 Fri 17:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sam's Emacs</title>
<meta name="author" content="Samuel Wallace" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sam's Emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgeb152d2">Intro</a></li>
<li><a href="#org2e736be">General</a>
<ul>
<li><a href="#org819dd32">Neofetch Start Screen&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bling">bling</span></span></a></li>
</ul>
</li>
<li><a href="#orge65a117">Document Preparation</a>
<ul>
<li><a href="#orgd1a51d0"><span class="todo IN">IN</span> PROGRESS Pure Latex&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TeX">TeX</span></span></a>
<ul>
<li><a href="#org83d2931"><span class="done CANCELLED">CANCELLED</span> make minor mode for wrapping text in LaTeX but not math mode text</a></li>
<li><a href="#org49ecc23"><span class="done CANCELLED">CANCELLED</span> Jump to items and sections</a></li>
</ul>
</li>
<li><a href="#org228e4dd">Org Settings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Org">Org</span></span></a></li>
<li><a href="#org6154385">Bibliography Management&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bibtex">bibtex</span></span></a></li>
</ul>
</li>
<li><a href="#org06377df">Keybindings and Emacs Management</a>
<ul>
<li><a href="#org54bc969">Editing Settings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></a></li>
<li><a href="#org220be25">Visual/Window settings</a>
<ul>
<li><a href="#org334807c">Try EXWM&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bling">bling</span>&#xa0;<span class="wm">wm</span></span></a></li>
<li><a href="#orgc691f8b">Dynamic Window Layouts&#xa0;&#xa0;&#xa0;<span class="tag"><span class="wm">wm</span></span></a></li>
</ul>
</li>
<li><a href="#org15d7597"><span class="done DONE">DONE</span> Minibuffer Frame</a></li>
<li><a href="#org4453a93">Avy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></a></li>
<li><a href="#org2365b60">Repeat Keymaps&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></a></li>
<li><a href="#orgeb87f75">PROGRESS Mini Embark-Become</a></li>
<li><a href="#orgacb1bef">Random Theme</a></li>
<li><a href="#org965597a">Work Mode</a></li>
</ul>
</li>
<li><a href="#orga756f74">External Integrations</a>
<ul>
<li><a href="#org69d4ef7"><span class="done CANCELLED">CANCELLED</span> Nyxt Integration&#xa0;&#xa0;&#xa0;<span class="tag"><span class="web">web</span></span></a></li>
<li><a href="#org1cdfc56"><span class="done CANCELLED">CANCELLED</span> Stumpwm&#xa0;&#xa0;&#xa0;<span class="tag"><span class="wm">wm</span></span></a>
<ul>
<li><a href="#org6382725"><span class="done CANCELLED">CANCELLED</span> Write major mode for editing a buffer for window manager interaction (dired/org-style)</a></li>
</ul>
</li>
<li><a href="#orgb89e54c">Elfeed&#xa0;&#xa0;&#xa0;<span class="tag"><span class="web">web</span></span></a></li>
<li><a href="#org01fea58">Wikipedia Search&#xa0;&#xa0;&#xa0;<span class="tag"><span class="web">web</span></span></a></li>
<li><a href="#org558a6ff">Mu4e Settings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mail">mail</span></span></a></li>
</ul>
</li>
<li><a href="#orgd5bd8bf">Resources</a>
<ul>
<li><a href="#orge712fc3">Beginner and General Resources</a></li>
<li><a href="#orgf4dbe99">Other's Configs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb152d2" class="outline-2">
<h2 id="orgeb152d2">Intro</h2>
<div class="outline-text-2" id="text-orgeb152d2">
<p>
This config is mainly for writing a mixture of Org and \(\LaTeX\) documents. Version controlling is done through Git.
</p>

<p>
This is organized as an Org document for several reasons: One is for readability, another for easy publishing as a webpage, but the main one is to allow other users to build their own configs from. How? Filtering by <code>TODO</code> keywords and tags. Want all my keybindings, but none of my LaTeX stuff? You can <code>org-sparse-tree</code> or <code>C-c /</code> to apply filters and select what you want. At the end of the day, tangle the filtered results.
</p>
</div>
</div>

<div id="outline-container-org2e736be" class="outline-2">
<h2 id="org2e736be">General</h2>
<div class="outline-text-2" id="text-org2e736be">
<p>
We make a run key that gives a menu to different programs you might want a glance at.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">add-menu-item</span> (key command)
       (global-set-key (kbd (concat <span style="color: #f1fa8c;">"C-; "</span> key)) command))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">find-init-file</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (find-file user-init-file))
(add-menu-item <span style="color: #f1fa8c;">"i"</span> 'find-init-file)
(add-menu-item <span style="color: #f1fa8c;">"p"</span> 'proced)
(<span style="color: #ff79c6; font-weight: bold;">setq</span> external-pdf-viewer <span style="color: #f1fa8c;">"zathura"</span>)
</pre>
</div>


<p>
Let's do a different custom-settings file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">setq</span> custom-file <span style="color: #f1fa8c;">"~/.emacs.d/custom.el"</span>)
(load-file custom-file)
</pre>
</div>
</div>

<div id="outline-container-org819dd32" class="outline-3">
<h3 id="org819dd32">Neofetch Start Screen&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bling">bling</span></span></h3>
<div class="outline-text-3" id="text-org819dd32">
<p>
We make a Neofetch start screen with lots of data for a startup screen (and for that sweet karma).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">neofetch</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (async-shell-command <span style="color: #f1fa8c;">"neofetch"</span> <span style="color: #f1fa8c;">"*Neofetch*"</span>))
(<span style="color: #ff79c6; font-weight: bold;">setq</span> inhibit-startup-screen t)
(neofetch)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge65a117" class="outline-2">
<h2 id="orge65a117">Document Preparation</h2>
<div class="outline-text-2" id="text-orge65a117">
</div>
<div id="outline-container-orgd1a51d0" class="outline-3">
<h3 id="orgd1a51d0"><span class="todo IN">IN</span> PROGRESS Pure Latex&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TeX">TeX</span></span></h3>
<div class="outline-text-3" id="text-orgd1a51d0">
<p>
We add a function for package load-time settings:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-init-settings</span> ()
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> TeX-parse-self t)
  (add-to-list 'TeX-command-list
               '(<span style="color: #f1fa8c;">"latexmk lualatex compile"</span> <span style="color: #f1fa8c;">"latexmk -lualatex %s"</span> TeX-run-command nil t))
  (add-to-list 'TeX-command-list
               '(<span style="color: #f1fa8c;">"latexmk lualatex preview"</span> <span style="color: #f1fa8c;">"latexmk -lualatex -pvc -view=none %s"</span> TeX-run-command nil t))
  (add-to-list 'TeX-command-list
               '(<span style="color: #f1fa8c;">"latexindent"</span> <span style="color: #f1fa8c;">"latexindent -w %s"</span> TeX-run-command nil t))
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> TeX-view-program-selection '((output-pdf <span style="color: #f1fa8c;">"Okular"</span>)))
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> cdlatex-math-modify-alist
        '((98 <span style="color: #f1fa8c;">"\\mathbb"</span> nil t nil nil)
          (102 <span style="color: #f1fa8c;">"\\mathfrak"</span> nil t nil nil)))
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> cdlatex-math-symbol-alist
        '((120 <span style="color: #f1fa8c;">"\\chi"</span> <span style="color: #f1fa8c;">"\\otimes"</span>)
          (62 <span style="color: #f1fa8c;">"\\geq"</span> <span style="color: #f1fa8c;">"\\geqsim"</span>)
          (60 <span style="color: #f1fa8c;">"\\leq"</span> <span style="color: #f1fa8c;">"\\lesssim"</span>))))
</pre>
</div>

<p>
Let's set a mode hook function:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-hook</span> ()
  (cdlatex-mode 1)
  (reftex-mode 1)
  (prettify-symbols-mode 1))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">latex</span>
  <span style="color: #8be9fd; font-style: italic;">:defer</span> t
  <span style="color: #8be9fd; font-style: italic;">:ensure</span> auctex
  <span style="color: #8be9fd; font-style: italic;">:config</span> (latex-init-settings))

(add-hook 'LaTeX-mode-hook 'latex-hook)
</pre>
</div>
</div>

<div id="outline-container-org83d2931" class="outline-4">
<h4 id="org83d2931"><span class="done CANCELLED">CANCELLED</span> make minor mode for wrapping text in LaTeX but not math mode text</h4>
<div class="outline-text-4" id="text-org83d2931">
<p>
Decided I didn't mind&#x2026; probably not worth the effort.
</p>
</div>
</div>

<div id="outline-container-org49ecc23" class="outline-4">
<h4 id="org49ecc23"><span class="done CANCELLED">CANCELLED</span> Jump to items and sections</h4>
<div class="outline-text-4" id="text-org49ecc23">
<p>
Let's try to write a function that jumps to the previous thing&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-last-item</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (isearch-backward <span style="color: #f1fa8c;">"\\item"</span>))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-last-section</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (isearch-backward <span style="color: #f1fa8c;">"\\.*section"</span>))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-next-item</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (isearch <span style="color: #f1fa8c;">"\\item"</span>))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-next-section</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (isearch <span style="color: #f1fa8c;">"\\.*section"</span>))
</pre>
</div>
</div>
</div>
</div>
