index.org
** Org Settings                                                         :Org:

   Several things go on here: we use some minor modes, we set scaling on Latex preview, and then we add CDLaTeX math symbols and commands.
   
#+BEGIN_SRC emacs-lisp
  (defun latex-in-org-settings ()
    (progn
	 (require 'ox-bibtex)
	 (setq org-highlight-latex-and-related '(latex script entities))
	 (plist-put org-format-latex-options :scale 2.0)
	 ))
#+END_SRC

   A small helper function

#+BEGIN_SRC emacs-lisp
  (defun org-indent-paragraph () (interactive)
	 (org-backward-paragraph)
	 (push-mark)
	 (org-forward-paragraph)
	 (org-indent-region
	  (mark) (point)))

  (defun org-insert-block (type header-args) (interactive "sBlock Type: \nsHeader Arguments: ")
	   (insert "\n#+BEGIN_" type " " header-args "\n\n#+END_" type)
	   (previous-line))
#+END_SRC


   Let's add some keywords, keybindings, and such:

#+BEGIN_SRC emacs-lisp
  (defun org-init-settings ()
    (latex-in-org-settings)
    (setq org-agenda-start-on-weekday 0)
    (require 'org-ref-ivy)
    (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
	  org-ref-insert-cite-function 'org-ref-cite-insert-ivy
	  org-ref-insert-label-function 'org-ref-insert-label-link
	  org-ref-insert-ref-function 'org-ref-insert-ref-link)
    (require 'org-ref)
    (require 'org-noter)
    (setq org-todo-keywords
	  '((sequence "IN" "NEXT ACTIONS" "WAITING FOR" "EVENTUALLY" "|" "DONE" "CANCELLED"))))
#+END_SRC

   Let's write an Org-mode-hook function:

#+BEGIN_SRC emacs-lisp
  (defun org-hook () ()
	 (visual-line-mode)
	 (local-set-key (kbd "C-c ]") 'org-ref-insert-link-hydra)
	 (local-set-key (kbd "C-c b") 'org-insert-block)
	 (org-cdlatex-mode))
#+END_SRC
    
#+BEGIN_SRC emacs-lisp
  (use-package org
    :defer t
    :config (org-init-settings))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-menu-item "a" 'org-agenda)
  (add-hook 'org-mode-hook 'org-hook)
#+END_SRC
    
** Bibliography Management                                           :bibtex:


#+BEGIN_SRC emacs-lisp
  (setq bibtex-completion-pdf-field "file"
	bibtex-completion-bibliography "~/zoterolib.bib"
	bibtex-completion-pdf-open-function
	(lambda (fpath) (call-process external-pdf-viewer nil 0 nil fpath))
	bibtex-completion-library-path '("~/pdfs"))
#+END_SRc

#+BEGIN_SRC emacs-lisp
  (add-menu-item "b" 'ivy-bibtex)
#+END_SRC

* Keybindings and Emacs Management
