index.html

<div id="outline-container-org228e4dd" class="outline-3">
<h3 id="org228e4dd">Org Settings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Org">Org</span></span></h3>
<div class="outline-text-3" id="text-org228e4dd">
<p>
Several things go on here: we use some minor modes, we set scaling on Latex preview, and then we add CDLaTeX math symbols and commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">latex-in-org-settings</span> ()
  (<span style="color: #ff79c6; font-weight: bold;">progn</span>
       (<span style="color: #ff79c6; font-weight: bold;">require</span> '<span style="color: #bd93f9;">ox-bibtex</span>)
       (<span style="color: #ff79c6; font-weight: bold;">setq</span> org-highlight-latex-and-related '(latex script entities))
       (plist-put org-format-latex-options <span style="color: #8be9fd; font-style: italic;">:scale</span> 2.0)
       ))
</pre>
</div>

<p>
A small helper function
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">org-indent-paragraph</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (org-backward-paragraph)
       (push-mark)
       (org-forward-paragraph)
       (org-indent-region
        (mark) (point)))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">org-insert-block</span> (type header-args) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"sBlock Type: \nsHeader Arguments: "</span>)
         (insert <span style="color: #f1fa8c;">"\n#+BEGIN_"</span> type <span style="color: #f1fa8c;">" "</span> header-args <span style="color: #f1fa8c;">"\n\n#+END_"</span> type)
         (previous-line))
</pre>
</div>


<p>
Let's add some keywords, keybindings, and such:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">org-init-settings</span> ()
  (latex-in-org-settings)
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> org-agenda-start-on-weekday 0)
  (<span style="color: #ff79c6; font-weight: bold;">require</span> '<span style="color: #bd93f9;">org-ref-ivy</span>)
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> org-ref-insert-link-function 'org-ref-insert-link-hydra/body
        org-ref-insert-cite-function 'org-ref-cite-insert-ivy
        org-ref-insert-label-function 'org-ref-insert-label-link
        org-ref-insert-ref-function 'org-ref-insert-ref-link)
  (<span style="color: #ff79c6; font-weight: bold;">require</span> '<span style="color: #bd93f9;">org-ref</span>)
  (<span style="color: #ff79c6; font-weight: bold;">require</span> '<span style="color: #bd93f9;">org-noter</span>)
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> org-todo-keywords
        '((sequence <span style="color: #f1fa8c;">"IN"</span> <span style="color: #f1fa8c;">"NEXT ACTIONS"</span> <span style="color: #f1fa8c;">"WAITING FOR"</span> <span style="color: #f1fa8c;">"EVENTUALLY"</span> <span style="color: #f1fa8c;">"|"</span> <span style="color: #f1fa8c;">"DONE"</span> <span style="color: #f1fa8c;">"CANCELLED"</span>))))
</pre>
</div>

<p>
Let's write an Org-mode-hook function:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">org-hook</span> () ()
       (visual-line-mode)
       (local-set-key (kbd <span style="color: #f1fa8c;">"C-c ]"</span>) 'org-ref-insert-link-hydra)
       (local-set-key (kbd <span style="color: #f1fa8c;">"C-c b"</span>) 'org-insert-block)
       (org-cdlatex-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">org</span>
  <span style="color: #8be9fd; font-style: italic;">:defer</span> t
  <span style="color: #8be9fd; font-style: italic;">:config</span> (org-init-settings))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-menu-item <span style="color: #f1fa8c;">"a"</span> 'org-agenda)
(add-hook 'org-mode-hook 'org-hook)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6154385" class="outline-3">
<h3 id="org6154385">Bibliography Management&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bibtex">bibtex</span></span></h3>
<div class="outline-text-3" id="text-org6154385">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">setq</span> bibtex-completion-pdf-field <span style="color: #f1fa8c;">"file"</span>
      bibtex-completion-bibliography <span style="color: #f1fa8c;">"~/zoterolib.bib"</span>
      bibtex-completion-pdf-open-function
      (<span style="color: #ff79c6; font-weight: bold;">lambda</span> (fpath) (call-process external-pdf-viewer nil 0 nil fpath))
      bibtex-completion-library-path '(<span style="color: #f1fa8c;">"~/pdfs"</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-menu-item <span style="color: #f1fa8c;">"b"</span> 'ivy-bibtex)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org06377df" class="outline-2">
<h2 id="org06377df">Keybindings and Emacs Management</h2>
<div class="outline-text-2" id="text-org06377df">
</div>
