index.org
** Editing Settings                                                    :keys:

   First we'll add some extra commands of my own...

#+BEGIN_SRC emacs-lisp
  (defun machine-uptime () (interactive) (shell-command "uptime"))
  (defun pacman-update () (interactive) (async-shell-command "sudo pacman -Syu"))
  (defun get-weather () (interactive)
	 (async-shell-command "curl -s 'https://wttr.in/chicago?0p'" "*wttr.in*" nil))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun smart-kill-word () (interactive)
	 (forward-word)
	 (kill-word -1))

  (defun my-editing-keybindings () (interactive)
	 (setq sentence-end-double-space nil)
	 (global-set-key (kbd "C-x s") 'swiper)
	 (global-set-key (kbd "C-k") 'crux-smart-kill-line)
	 (global-set-key (kbd "M-d") 'smart-kill-word)
	 (unbind-key "C-z")
	 (global-set-key (kbd "C-z p") 'ping)
	 (global-set-key (kbd "C-z t") 'machine-uptime)
	 (global-set-key (kbd "C-z b") 'battery)
	 (global-set-key (kbd "C-z u") 'pacman-update)
	 (global-set-key (kbd "C-z w") 'get-weather)
	    )
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package magit)
#+END_SRC

#+BEGIN_SRC emacs-lisp
      (use-package projectile
      :config (progn
		(projectile-mode 1)
		(define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package dired-x
  :config (progn
	    (setq dired-listing-switches "-ahl")
	    (setq dired-guess-shell-alist-user
		  `(("\\.bib$" "~/.local/bin/bibly")
		    ("\\.pdf$" ,(concat external-pdf-viewer " *"))))))
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (defun counsel-keybindings () (interactive)
	 (global-set-key (kbd "M-o") 'ace-window)
	 (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
	 (global-set-key (kbd "M-s m") 'counsel-imenu)
	 (global-set-key (kbd "M-s b") 'counsel-ibuffer)
	 (global-set-key (kbd "C-x b") 'counsel-switch-buffer)
	 (global-set-key (kbd "C-x 4 b") 'counsel-switch-buffer-other-window)
	 (global-set-key (kbd "M-z") 'counsel-linux-app))
#+END_SRC

#+BEGIN_SRC emacs-lisp
    (use-package counsel
    :config (progn
	      (counsel-mode 1)
	      (counsel-projectile-mode 1)
	      (ivy-mode 1)
	      (counsel-keybindings)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package crux
  :config (my-editing-keybindings))
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (repeat-mode)
#+END_SRC

** Visual/Window settings

*** Try EXWM                                                       :bling:wm:

+Decided not to. A fully-afeatured window manager is /probably/ better.+

It's back with a vengeance.

Here we goooo....

#+BEGIN_src emacs-lisp :tangle no

  (defun lock-screen-with-slock () (interactive) (call-process "slock"))

  (defun exwm-settings ()
      (setq exwm-workspace-number 4)
      (add-hook 'exwm-update-class-hook
	    (lambda ()
	      (unless (or (string-prefix-p "sun-awt-X11-" exwm-instance-name)
			  (string= "gimp" exwm-instance-name))
		(exwm-workspace-rename-buffer exwm-class-name))))
      (add-hook 'exwm-update-title-hook
		(lambda ()
	      (when (or (not exwm-instance-name)
			(string-prefix-p "sun-awt-X11-" exwm-instance-name)
			(string= "gimp" exwm-instance-name))
		(exwm-workspace-rename-buffer exwm-title))))
      (setq exwm-input-global-keys
	    `((,(kbd "s-SPC") . counsel-linux-app)
	      (,(kbd "s-r") . exwm-reset)
	      (,(kbd "s-M-o") . exwm-workspace-switch-to-buffer)
	      (,(kbd "s-o") . exwm-workspace-switch)
	      (,(kbd "s-g") . lock-screen-with-slock)
	      )
	    )
      (exwm-enable)
      )
    (use-package exwm-randr
      :config (progn
		(setq exwm-randr-workspace-output-plist '(0 "eDP-1" 1 "eDP-1" 2 "HDMI-1" 3 "HDMI-1"))
		(add-hook 'ewm-randr-screen-change-hook
			  (lambda ()
			    (start-process-shell-command
			     "xrandr" nil "xrandr --output HDMI-1 --right-of eDP-1 --auto")))
		(exwm-randr-enable)))
    (use-package exwm
      :config (exwm-settings))

#+END_src


<2022-05-21 Sat> Well, it's been fun folks. I'm done with full-time EXWM, and back to Awesomewm. I'll keep the above snippet for any interested parties.


