index.html
<div id="outline-container-org54bc969" class="outline-3">
<h3 id="org54bc969">Editing Settings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></h3>
<div class="outline-text-3" id="text-org54bc969">
<p>
First we'll add some extra commands of my own&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">machine-uptime</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (shell-command <span style="color: #f1fa8c;">"uptime"</span>))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">pacman-update</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (async-shell-command <span style="color: #f1fa8c;">"sudo pacman -Syu"</span>))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">get-weather</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (async-shell-command <span style="color: #f1fa8c;">"curl -s '</span><span style="color: #bd93f9;">https://wttr.in/chicago?0p</span><span style="color: #f1fa8c;">'"</span> <span style="color: #f1fa8c;">"*wttr.in*"</span> nil))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">smart-kill-word</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (forward-word)
       (kill-word -1))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">my-editing-keybindings</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (<span style="color: #ff79c6; font-weight: bold;">setq</span> sentence-end-double-space nil)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-x s"</span>) 'swiper)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-k"</span>) 'crux-smart-kill-line)
       (global-set-key (kbd <span style="color: #f1fa8c;">"M-d"</span>) 'smart-kill-word)
       (<span style="color: #ff79c6; font-weight: bold;">unbind-key</span> <span style="color: #f1fa8c;">"C-z"</span>)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-z p"</span>) 'ping)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-z t"</span>) 'machine-uptime)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-z b"</span>) 'battery)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-z u"</span>) 'pacman-update)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-z w"</span>) 'get-weather)
          )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">magit</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">projectile</span>
<span style="color: #8be9fd; font-style: italic;">:config</span> (<span style="color: #ff79c6; font-weight: bold;">progn</span>
          (projectile-mode 1)
          (define-key projectile-mode-map (kbd <span style="color: #f1fa8c;">"C-x p"</span>) 'projectile-command-map)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">dired-x</span>
<span style="color: #8be9fd; font-style: italic;">:config</span> (<span style="color: #ff79c6; font-weight: bold;">progn</span>
          (<span style="color: #ff79c6; font-weight: bold;">setq</span> dired-listing-switches <span style="color: #f1fa8c;">"-ahl"</span>)
          (<span style="color: #ff79c6; font-weight: bold;">setq</span> dired-guess-shell-alist-user
                `((<span style="color: #f1fa8c;">"\\.bib$"</span> <span style="color: #f1fa8c;">"~/.local/bin/bibly"</span>)
                  (<span style="color: #f1fa8c;">"\\.pdf$"</span> ,(concat external-pdf-viewer <span style="color: #f1fa8c;">" *"</span>))))))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">counsel-keybindings</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (global-set-key (kbd <span style="color: #f1fa8c;">"M-o"</span>) 'ace-window)
       (<span style="color: #ff79c6; font-weight: bold;">setq</span> aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
       (global-set-key (kbd <span style="color: #f1fa8c;">"M-s m"</span>) 'counsel-imenu)
       (global-set-key (kbd <span style="color: #f1fa8c;">"M-s b"</span>) 'counsel-ibuffer)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-x b"</span>) 'counsel-switch-buffer)
       (global-set-key (kbd <span style="color: #f1fa8c;">"C-x 4 b"</span>) 'counsel-switch-buffer-other-window)
       (global-set-key (kbd <span style="color: #f1fa8c;">"M-z"</span>) 'counsel-linux-app))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">counsel</span>
<span style="color: #8be9fd; font-style: italic;">:config</span> (<span style="color: #ff79c6; font-weight: bold;">progn</span>
          (counsel-mode 1)
          (counsel-projectile-mode 1)
          (ivy-mode 1)
          (counsel-keybindings)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">crux</span>
<span style="color: #8be9fd; font-style: italic;">:config</span> (my-editing-keybindings))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(repeat-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org220be25" class="outline-3">
<h3 id="org220be25">Visual/Window settings</h3>
<div class="outline-text-3" id="text-org220be25">
</div>
<div id="outline-container-org334807c" class="outline-4">
<h4 id="org334807c">Try EXWM&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bling">bling</span>&#xa0;<span class="wm">wm</span></span></h4>
<div class="outline-text-4" id="text-org334807c">
<p>
<del>Decided not to. A fully-afeatured window manager is <i>probably</i> better.</del>
</p>

<p>
It's back with a vengeance.
</p>

<p>
Here we goooo&#x2026;.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">lock-screen-with-slock</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (call-process <span style="color: #f1fa8c;">"slock"</span>))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">exwm-settings</span> ()
    (<span style="color: #ff79c6; font-weight: bold;">setq</span> exwm-workspace-number 4)
    (add-hook 'exwm-update-class-hook
          (<span style="color: #ff79c6; font-weight: bold;">lambda</span> ()
            (<span style="color: #ff79c6; font-weight: bold;">unless</span> (<span style="color: #ff79c6; font-weight: bold;">or</span> (string-prefix-p <span style="color: #f1fa8c;">"sun-awt-X11-"</span> exwm-instance-name)
                        (string= <span style="color: #f1fa8c;">"gimp"</span> exwm-instance-name))
              (exwm-workspace-rename-buffer exwm-class-name))))
    (add-hook 'exwm-update-title-hook
              (<span style="color: #ff79c6; font-weight: bold;">lambda</span> ()
            (<span style="color: #ff79c6; font-weight: bold;">when</span> (<span style="color: #ff79c6; font-weight: bold;">or</span> (not exwm-instance-name)
                      (string-prefix-p <span style="color: #f1fa8c;">"sun-awt-X11-"</span> exwm-instance-name)
                      (string= <span style="color: #f1fa8c;">"gimp"</span> exwm-instance-name))
              (exwm-workspace-rename-buffer exwm-title))))
    (<span style="color: #ff79c6; font-weight: bold;">setq</span> exwm-input-global-keys
          `((,(kbd <span style="color: #f1fa8c;">"s-SPC"</span>) . counsel-linux-app)
            (,(kbd <span style="color: #f1fa8c;">"s-r"</span>) . exwm-reset)
            (,(kbd <span style="color: #f1fa8c;">"s-M-o"</span>) . exwm-workspace-switch-to-buffer)
            (,(kbd <span style="color: #f1fa8c;">"s-o"</span>) . exwm-workspace-switch)
            (,(kbd <span style="color: #f1fa8c;">"s-g"</span>) . lock-screen-with-slock)
            )
          )
    (exwm-enable)
    )
  (<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">exwm-randr</span>
    <span style="color: #8be9fd; font-style: italic;">:config</span> (<span style="color: #ff79c6; font-weight: bold;">progn</span>
              (<span style="color: #ff79c6; font-weight: bold;">setq</span> exwm-randr-workspace-output-plist '(0 <span style="color: #f1fa8c;">"eDP-1"</span> 1 <span style="color: #f1fa8c;">"eDP-1"</span> 2 <span style="color: #f1fa8c;">"HDMI-1"</span> 3 <span style="color: #f1fa8c;">"HDMI-1"</span>))
              (add-hook 'ewm-randr-screen-change-hook
                        (<span style="color: #ff79c6; font-weight: bold;">lambda</span> ()
                          (start-process-shell-command
                           <span style="color: #f1fa8c;">"xrandr"</span> nil <span style="color: #f1fa8c;">"xrandr --output HDMI-1 --right-of eDP-1 --auto"</span>)))
              (exwm-randr-enable)))
  (<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">exwm</span>
    <span style="color: #8be9fd; font-style: italic;">:config</span> (exwm-settings))

</pre>
</div>


<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-05-21 Sat&gt; </span></span> Well, it's been fun folks. I'm done with full-time EXWM, and back to Awesomewm. I'll keep the above snippet for any interested parties.
</p>
</div>
</div>
