index.org
*** Dynamic Window Layouts                                               :wm:

    Here we look to implement two dynamic window layouts, inspired by tiling window managers. This replaces the native window splitting function. 

    We first do an XMonad Tall layout:
    #+BEGIN_SRC emacs-lisp
      (defun xmonad-tree-navigator (tree)
	(if (windowp tree) tree
	  (if (listp tree) (xmonad-tree-navigator (car (last tree)))
	      (error "Encountered a non-list or non window argument"))))

      (defun xmonad-tall (curr-win)
	     (if (one-window-p) (split-window-right)
	       (progn
		 (select-window (xmonad-tree-navigator (car (window-tree))))
		 (split-window-below))))
    #+END_SRC

    And we do a BSPWM one (or a vertical split version):

    #+BEGIN_SRC emacs-lisp
      (defun bsp-tree-navigator (tree)
	(if (windowp tree) tree
	  (if (listp tree) (bsp-tree-navigator (car (last tree)))
	    (error "Encountered a non-list or non-window argument"))))

      (defun bspwm (curr-win)
	     (let ((to-window (bsp-tree-navigator (car (window-tree)))))
	       (progn
		 (select-window to-window)
		 (if (window-combined-p to-window t)
		     (split-window-below)
		   (split-window-right)))))
      
      (defun bspwm-vert (curr-win)
	     (let ((to-window (bsp-tree-navigator (car (window-tree)))))
	       (progn
		 (select-window to-window)
		 (if (window-combined-p to-window)
		     (split-window-right)
		   (split-window-below)))))
    #+END_SRC

    And now we add a function to switch between layouts:

    #+BEGIN_SRC emacs-lisp
      (setq layout-list '(split-window-sensibly xmonad-tall bspwm bspwm-vert))
      (defun select-window-layout (symbol) (interactive "Slayout: ")
	     (if (member symbol layout-list) (setq split-window-preferred-function symbol)
	       (error "Not a layout in layout-list")))
      (defun current-window-layout () (interactive)
	     (message split-window-preferred-function))
    #+END_SRC

** DONE Minibuffer Frame

Here we create a pop-up minibuffer window to use where ever. The model is this: you should run ~emacsclient --eval '(runner)'~ and the minibuffer menu should appear.

#+BEGIN_SRC emacs-lisp :tangle no
  (defun runner () (interactive)
	 (setq default-minibuffer-frame (make-frame
					 '((minibuffer . only) (title . "erunner") (left . 0.25) (top . 0.25) (height . 0.5) (width . 0.5))))
	 (setq minibuffer-auto-raise t))
#+END_SRC

Currently needs:
 - [ ] raise frame if already created
 - [X] put windows in main frame (just use ~C-x C-f~ or regular keybindings; just not the usual keybinds)



 <2022-04-21 Thu> With the addition of [[Try EXWM]], I have no big use for this.

** Avy                                                                 :keys:

   Let's get warmed up with some simple keybindings for avy:

#+BEGIN_SRC emacs-lisp
  (defun my-avy-keybindings () (interactive)
  (global-set-key (kbd "M-g g") 'avy-goto-char-2)
  (global-set-key (kbd "M-g c") 'avy-goto-char)
  (global-set-key (kbd "M-g M-g") 'avy-goto-line)
  (global-set-key (kbd "M-g f") 'avy-goto-char-in-line)
  (global-set-key (kbd "M-g e") 'avy-goto-end-of-line))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package avy
  :config (my-avy-keybindings))
#+END_SRC

** Repeat Keymaps                                                      :keys:

Repeat keymaps that are useful to me:

#+BEGIN_SRC emacs-lisp

  (defvar make-window-repeat-map
    (let ((map (make-sparse-keymap)))
	  (define-key map "2" 'split-window-below)
	  (define-key map "3" 'split-window-right)
	  (define-key map "0" 'delete-window)
	  (define-key map "=" 'balance-windows)
	  (define-key map "b" 'switch-to-buffer) map)
      "making, breaking, and switching window. for use in repeat-mode")

  (put 'split-window-below 'repeat-map 'make-window-repeat-map)
  (put 'split-window-right 'repeat-map 'make-window-repeat-map)
  (put 'delete-window 'repeat-map 'make-window-repeat-map)
  (put 'balance-windows 'repeat-map 'make-window-repeat-map)
  (put 'switch-to-buffer 'repeat-map 'make-window-repeat-map)
#+END_SRC

Moving around the buffer...

#+BEGIN_SRC emacs-lisp
  (defvar move-map
    (let ((map (make-sparse-keymap)))
      (define-key map "n" 'next-line)
      (define-key map "p" 'previous-line)
      (define-key map "a" 'beginning-of-line-text)
      (define-key map "e" 'end-of-line)
      (define-key map "f" 'forward-word)
      (define-key map "g" 'keyboard-quit)
      (define-key map "b" 'backward-word)
      (define-key map (kbd "SPC") 'set-mark-command)
      (define-key map "w" 'kill-region)
      (define-key map "y" 'yank) map)
    "movement and editing commands. tiny vim normal mode.")

  (put 'next-line 'repeat-map 'move-map)
  (put 'previous-line 'repeat-map 'move-map)
  (put 'beginning-of-line-text 'repeat-map 'move-map)
  (put 'end-of-line 'repeat-map 'move-map)
  (put 'set-mark-command 'repeat-map 'move-map)
  (put 'kill-region 'repeat-map 'move-map)
  (put 'yank 'repeat-map 'move-map)
  (put 'forward-word 'repeat-map 'move-map)
  (put 'backward-word 'repeat-map 'move-map)

#+END_SRC

