index.html


<div id="outline-container-orgc691f8b" class="outline-4">
<h4 id="orgc691f8b">Dynamic Window Layouts&#xa0;&#xa0;&#xa0;<span class="tag"><span class="wm">wm</span></span></h4>
<div class="outline-text-4" id="text-orgc691f8b">
<p>
Here we look to implement two dynamic window layouts, inspired by tiling window managers. This replaces the native window splitting function. 
</p>

<p>
We first do an XMonad Tall layout:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">xmonad-tree-navigator</span> (tree)
  (<span style="color: #ff79c6; font-weight: bold;">if</span> (windowp tree) tree
    (<span style="color: #ff79c6; font-weight: bold;">if</span> (listp tree) (xmonad-tree-navigator (car (last tree)))
        (<span style="color: #dbbe5f; background-color: #373844; font-weight: bold;">error</span> <span style="color: #f1fa8c;">"Encountered a non-list or non window argument"</span>))))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">xmonad-tall</span> (curr-win)
       (<span style="color: #ff79c6; font-weight: bold;">if</span> (one-window-p) (split-window-right)
         (<span style="color: #ff79c6; font-weight: bold;">progn</span>
           (select-window (xmonad-tree-navigator (car (window-tree))))
           (split-window-below))))
</pre>
</div>

<p>
And we do a BSPWM one (or a vertical split version):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">bsp-tree-navigator</span> (tree)
  (<span style="color: #ff79c6; font-weight: bold;">if</span> (windowp tree) tree
    (<span style="color: #ff79c6; font-weight: bold;">if</span> (listp tree) (bsp-tree-navigator (car (last tree)))
      (<span style="color: #dbbe5f; background-color: #373844; font-weight: bold;">error</span> <span style="color: #f1fa8c;">"Encountered a non-list or non-window argument"</span>))))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">bspwm</span> (curr-win)
       (<span style="color: #ff79c6; font-weight: bold;">let</span> ((to-window (bsp-tree-navigator (car (window-tree)))))
         (<span style="color: #ff79c6; font-weight: bold;">progn</span>
           (select-window to-window)
           (<span style="color: #ff79c6; font-weight: bold;">if</span> (window-combined-p to-window t)
               (split-window-below)
             (split-window-right)))))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">bspwm-vert</span> (curr-win)
       (<span style="color: #ff79c6; font-weight: bold;">let</span> ((to-window (bsp-tree-navigator (car (window-tree)))))
         (<span style="color: #ff79c6; font-weight: bold;">progn</span>
           (select-window to-window)
           (<span style="color: #ff79c6; font-weight: bold;">if</span> (window-combined-p to-window)
               (split-window-right)
             (split-window-below)))))
</pre>
</div>

<p>
And now we add a function to switch between layouts:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">setq</span> layout-list '(split-window-sensibly xmonad-tall bspwm bspwm-vert))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">select-window-layout</span> (symbol) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"Slayout: "</span>)
       (<span style="color: #ff79c6; font-weight: bold;">if</span> (member symbol layout-list) (<span style="color: #ff79c6; font-weight: bold;">setq</span> split-window-preferred-function symbol)
         (<span style="color: #dbbe5f; background-color: #373844; font-weight: bold;">error</span> <span style="color: #f1fa8c;">"Not a layout in layout-list"</span>)))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">current-window-layout</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (message split-window-preferred-function))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15d7597" class="outline-3">
<h3 id="org15d7597"><span class="done DONE">DONE</span> Minibuffer Frame</h3>
<div class="outline-text-3" id="text-org15d7597">
<p>
Here we create a pop-up minibuffer window to use where ever. The model is this: you should run <code>emacsclient --eval '(runner)'</code> and the minibuffer menu should appear.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">runner</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
       (<span style="color: #ff79c6; font-weight: bold;">setq</span> default-minibuffer-frame (make-frame
                                       '((minibuffer . only) (title . <span style="color: #f1fa8c;">"erunner"</span>) (left . 0.25) (top . 0.25) (height . 0.5) (width . 0.5))))
       (<span style="color: #ff79c6; font-weight: bold;">setq</span> minibuffer-auto-raise t))
</pre>
</div>

<p>
Currently needs:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> raise frame if already created</li>
<li class="on"><code>[X]</code> put windows in main frame (just use <code>C-x C-f</code> or regular keybindings; just not the usual keybinds)</li>
</ul>



<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-21 Thu&gt; </span></span> With the addition of <a href="#org334807c">Try EXWM</a>, I have no big use for this.
</p>
</div>
</div>

<div id="outline-container-org4453a93" class="outline-3">
<h3 id="org4453a93">Avy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></h3>
<div class="outline-text-3" id="text-org4453a93">
<p>
Let's get warmed up with some simple keybindings for avy:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">my-avy-keybindings</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
(global-set-key (kbd <span style="color: #f1fa8c;">"M-g g"</span>) 'avy-goto-char-2)
(global-set-key (kbd <span style="color: #f1fa8c;">"M-g c"</span>) 'avy-goto-char)
(global-set-key (kbd <span style="color: #f1fa8c;">"M-g M-g"</span>) 'avy-goto-line)
(global-set-key (kbd <span style="color: #f1fa8c;">"M-g f"</span>) 'avy-goto-char-in-line)
(global-set-key (kbd <span style="color: #f1fa8c;">"M-g e"</span>) 'avy-goto-end-of-line))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">avy</span>
<span style="color: #8be9fd; font-style: italic;">:config</span> (my-avy-keybindings))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2365b60" class="outline-3">
<h3 id="org2365b60">Repeat Keymaps&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keys">keys</span></span></h3>
<div class="outline-text-3" id="text-org2365b60">
<p>
Repeat keymaps that are useful to me:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #ff79c6; font-weight: bold;">defvar</span> <span style="color: #f8f8f2; font-weight: bold;">make-window-repeat-map</span>
  (<span style="color: #ff79c6; font-weight: bold;">let</span> ((map (make-sparse-keymap)))
        (define-key map <span style="color: #f1fa8c;">"2"</span> 'split-window-below)
        (define-key map <span style="color: #f1fa8c;">"3"</span> 'split-window-right)
        (define-key map <span style="color: #f1fa8c;">"0"</span> 'delete-window)
        (define-key map <span style="color: #f1fa8c;">"="</span> 'balance-windows)
        (define-key map <span style="color: #f1fa8c;">"b"</span> 'switch-to-buffer) map)
    <span style="color: #6272a4;">"making, breaking, and switching window. for use in repeat-mode"</span>)

(put 'split-window-below 'repeat-map 'make-window-repeat-map)
(put 'split-window-right 'repeat-map 'make-window-repeat-map)
(put 'delete-window 'repeat-map 'make-window-repeat-map)
(put 'balance-windows 'repeat-map 'make-window-repeat-map)
(put 'switch-to-buffer 'repeat-map 'make-window-repeat-map)
</pre>
</div>

<p>
Moving around the buffer&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defvar</span> <span style="color: #f8f8f2; font-weight: bold;">move-map</span>
  (<span style="color: #ff79c6; font-weight: bold;">let</span> ((map (make-sparse-keymap)))
    (define-key map <span style="color: #f1fa8c;">"n"</span> 'next-line)
    (define-key map <span style="color: #f1fa8c;">"p"</span> 'previous-line)
    (define-key map <span style="color: #f1fa8c;">"a"</span> 'beginning-of-line-text)
    (define-key map <span style="color: #f1fa8c;">"e"</span> 'end-of-line)
    (define-key map <span style="color: #f1fa8c;">"f"</span> 'forward-word)
    (define-key map <span style="color: #f1fa8c;">"g"</span> 'keyboard-quit)
    (define-key map <span style="color: #f1fa8c;">"b"</span> 'backward-word)
    (define-key map (kbd <span style="color: #f1fa8c;">"SPC"</span>) 'set-mark-command)
    (define-key map <span style="color: #f1fa8c;">"w"</span> 'kill-region)
    (define-key map <span style="color: #f1fa8c;">"y"</span> 'yank) map)
  <span style="color: #6272a4;">"movement and editing commands. tiny vim normal mode."</span>)

(put 'next-line 'repeat-map 'move-map)
(put 'previous-line 'repeat-map 'move-map)
(put 'beginning-of-line-text 'repeat-map 'move-map)
(put 'end-of-line 'repeat-map 'move-map)
(put 'set-mark-command 'repeat-map 'move-map)
(put 'kill-region 'repeat-map 'move-map)
(put 'yank 'repeat-map 'move-map)
(put 'forward-word 'repeat-map 'move-map)
(put 'backward-word 'repeat-map 'move-map)

</pre>
</div>
</div>
</div>
