index.org
** PROGRESS Mini Embark-Become

Here's a miniature version of Embark's ~embark-become~:

#+BEGIN_SRC emacs-lisp

  (defvar cumulative-object-ring nil "An object to be repeatedly acted on by stick-cmd")

  (defun cumulative-push-object (lisp-object) (interactive "XLisp Object:") (push lisp-object cumulative-object-ring))

  (defvar cumulative-action-ring nil  "A list of symbols to act on cumulative-object")

  (defun cumulative-push-action (command) (interactive "CCumulative Action:") (push command cumulative-actions))

  (defun cumulative-exec ()
    (interactive)
    (dolist (cmd cumulative-actions)
      (dolist (cumulative-object cumulative-object-ring)
      (eval `(,cmd ,cumulative-object))))
    (setq cumulative-object nil)
    (setq cumulative-actions nil))
#+END_SRC

Here are some quick-use functions:

#+BEGIN_SRC emacs-lisp
  (defun cumulative-push-buffer (buf) (interactive "bCumulative Buffer:") (push buf cumulative-object-ring))
  (defun cumulative-push-file (fil) (interactive "FCumulative File:") (push buf cumulative-object-ring))
  (defun cumulative-push-region (beg end) (interactive "r") (push (list beg end) cumulative-object-ring))

  (defun cumulative-push-save-and-kill () (interactive) (cumulative-push-action 'save-buffer) (cumulative-push-action 'kill-buffer))
  (defun cumulative-push-find-other-window () (interactive) (cumulative-push-action 'find-file-other-window))
  (defun cumulative-push-kill () (interactive) (cumulative-push-action 'kill-region))

  (defun cumulative-clear-actions () (interactive) (setq cumulative-action-ring nil))
  (defun cumulative-clear-objects () (interactive) (setq cumulative-object-ring nil))

#+END_SRC

And we make a minor mode with key-bindings:

#+BEGIN_SRC emacs-lisp
  
  (defvar cumulative-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "M-c o") 'cumulative-push-object)
      (define-key map (kbd "M-c a") 'cumulative-push-action)
      (define-key map (kbd "M-c x") 'cumulative-exec)
      (define-key map (kbd "M-c b") 'cumulative-push-buffer)
      (define-key map (kbd "M-c f") 'cumulative-push-file)
      (define-key map (kbd "M-c r") 'cumulative-push-region)
      (define-key map (kbd "M-c s") 'cumulative-push-save-and-kill)
      (define-key map (kbd "M-c 4 f") 'cumulative-push-find-other-window)
      (define-key map (kbd "M-c k") 'cumulative-push-kill) map)
    "keymap for some common cumulative commands")

  (define-minor-mode cumulative-mode
    "collect functions and targets for cumulative actions that can be executed."
    :global t
    :init-value nil
    :lighter " cum"
    :keymap cumulative-map)
#+END_SRC

** Random Theme

Switch to a random dark theme, because why not?

#+BEGIN_SRC emacs-lisp

  (setq my-dark-themes [dracula
			modus-vivendi
			alect-black
			alect-black-alt
			alect-dark
			alect-dark-alt
			gruvbox-dark-hard
			gruvbox-dark-medium
			gruvbox-dark-medium])

  (defun load-random-theme (theme-list) (interactive "XTheme List: ")
	 (load-theme (seq-random-elt theme-list) t))

  (load-random-theme my-dark-themes)
#+END_SRC

** Work Mode

This mode designates predefined directories as 'work directories:' if you have a file open in a directory, you won't be able to open any other files in other directories without closing all your work directories. This is to incentivize staying on-task.


#+BEGIN_src emacs-lisp
  (setq my-work-dirs  '("~/repos/AppliedAnalysis/"  "~/school/"))

  (defun leave-work () (let ((leaving (y-or-n-p "Leave all your work behind?")))
			 (if leaving (mapc (lambda (buf)
					     (if (member t (mapcar (lambda (dir) (if (buffer-file-name buf) (locate-dominating-file (buffer-file-name buf) dir))) my-work-dirs))
						 (kill-buffer buf)))
					   (buffer-list)))
			   leaving))

#+END_src

* External Integrations
