index.html

<div id="outline-container-orgeb87f75" class="outline-3">
<h3 id="orgeb87f75">PROGRESS Mini Embark-Become</h3>
<div class="outline-text-3" id="text-orgeb87f75">
<p>
Here's a miniature version of Embark's <code>embark-become</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #ff79c6; font-weight: bold;">defvar</span> <span style="color: #f8f8f2; font-weight: bold;">cumulative-object-ring</span> nil <span style="color: #6272a4;">"An object to be repeatedly acted on by stick-cmd"</span>)

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-object</span> (lisp-object) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"XLisp Object:"</span>) (<span style="color: #ff79c6; font-weight: bold;">push</span> lisp-object cumulative-object-ring))

(<span style="color: #ff79c6; font-weight: bold;">defvar</span> <span style="color: #f8f8f2; font-weight: bold;">cumulative-action-ring</span> nil  <span style="color: #6272a4;">"A list of symbols to act on cumulative-object"</span>)

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-action</span> (command) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"CCumulative Action:"</span>) (<span style="color: #ff79c6; font-weight: bold;">push</span> command cumulative-actions))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-exec</span> ()
  (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
  (<span style="color: #ff79c6; font-weight: bold;">dolist</span> (cmd cumulative-actions)
    (<span style="color: #ff79c6; font-weight: bold;">dolist</span> (cumulative-object cumulative-object-ring)
    (eval `(,cmd ,cumulative-object))))
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> cumulative-object nil)
  (<span style="color: #ff79c6; font-weight: bold;">setq</span> cumulative-actions nil))
</pre>
</div>

<p>
Here are some quick-use functions:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-buffer</span> (buf) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"bCumulative Buffer:"</span>) (<span style="color: #ff79c6; font-weight: bold;">push</span> buf cumulative-object-ring))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-file</span> (fil) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"FCumulative File:"</span>) (<span style="color: #ff79c6; font-weight: bold;">push</span> buf cumulative-object-ring))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-region</span> (beg end) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"r"</span>) (<span style="color: #ff79c6; font-weight: bold;">push</span> (list beg end) cumulative-object-ring))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-save-and-kill</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (cumulative-push-action 'save-buffer) (cumulative-push-action 'kill-buffer))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-find-other-window</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (cumulative-push-action 'find-file-other-window))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-push-kill</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (cumulative-push-action 'kill-region))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-clear-actions</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (<span style="color: #ff79c6; font-weight: bold;">setq</span> cumulative-action-ring nil))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-clear-objects</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>) (<span style="color: #ff79c6; font-weight: bold;">setq</span> cumulative-object-ring nil))

</pre>
</div>

<p>
And we make a minor mode with key-bindings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #ff79c6; font-weight: bold;">defvar</span> <span style="color: #f8f8f2; font-weight: bold;">cumulative-map</span>
  (<span style="color: #ff79c6; font-weight: bold;">let</span> ((map (make-sparse-keymap)))
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c o"</span>) 'cumulative-push-object)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c a"</span>) 'cumulative-push-action)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c x"</span>) 'cumulative-exec)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c b"</span>) 'cumulative-push-buffer)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c f"</span>) 'cumulative-push-file)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c r"</span>) 'cumulative-push-region)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c s"</span>) 'cumulative-push-save-and-kill)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c 4 f"</span>) 'cumulative-push-find-other-window)
    (define-key map (kbd <span style="color: #f1fa8c;">"M-c k"</span>) 'cumulative-push-kill) map)
  <span style="color: #6272a4;">"keymap for some common cumulative commands"</span>)

(<span style="color: #ff79c6; font-weight: bold;">define-minor-mode</span> <span style="color: #50fa7b; font-weight: bold;">cumulative-mode</span>
  <span style="color: #6272a4;">"collect functions and targets for cumulative actions that can be executed."</span>
  <span style="color: #8be9fd; font-style: italic;">:global</span> t
  <span style="color: #8be9fd; font-style: italic;">:init-value</span> nil
  <span style="color: #8be9fd; font-style: italic;">:lighter</span> <span style="color: #f1fa8c;">" cum"</span>
  <span style="color: #8be9fd; font-style: italic;">:keymap</span> cumulative-map)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgacb1bef" class="outline-3">
<h3 id="orgacb1bef">Random Theme</h3>
<div class="outline-text-3" id="text-orgacb1bef">
<p>
Switch to a random dark theme, because why not?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #ff79c6; font-weight: bold;">setq</span> my-dark-themes [dracula
                      modus-vivendi
                      alect-black
                      alect-black-alt
                      alect-dark
                      alect-dark-alt
                      gruvbox-dark-hard
                      gruvbox-dark-medium
                      gruvbox-dark-medium])

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">load-random-theme</span> (theme-list) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"XTheme List: "</span>)
       (load-theme (seq-random-elt theme-list) t))

(load-random-theme my-dark-themes)
</pre>
</div>
</div>
</div>

<div id="outline-container-org965597a" class="outline-3">
<h3 id="org965597a">Work Mode</h3>
<div class="outline-text-3" id="text-org965597a">
<p>
This mode designates predefined directories as 'work directories:' if you have a file open in a directory, you won't be able to open any other files in other directories without closing all your work directories. This is to incentivize staying on-task.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">setq</span> my-work-dirs  '(<span style="color: #f1fa8c;">"~/repos/AppliedAnalysis/"</span>  <span style="color: #f1fa8c;">"~/school/"</span>))

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">leave-work</span> () (<span style="color: #ff79c6; font-weight: bold;">let</span> ((leaving (y-or-n-p <span style="color: #f1fa8c;">"Leave all your work behind?"</span>)))
                       (<span style="color: #ff79c6; font-weight: bold;">if</span> leaving (mapc (<span style="color: #ff79c6; font-weight: bold;">lambda</span> (buf)
                                           (<span style="color: #ff79c6; font-weight: bold;">if</span> (member t (mapcar (<span style="color: #ff79c6; font-weight: bold;">lambda</span> (dir) (<span style="color: #ff79c6; font-weight: bold;">if</span> (buffer-file-name buf) (locate-dominating-file (buffer-file-name buf) dir))) my-work-dirs))
                                               (kill-buffer buf)))
                                         (buffer-list)))
                         leaving))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga756f74" class="outline-2">
<h2 id="orga756f74">External Integrations</h2>
<div class="outline-text-2" id="text-orga756f74">
</div>
