index.org
** CANCELLED Nyxt Integration                                           :web:

   Here we provide a couple of helper functions for interacting with [[https://nyxt.atlas.engineer][Nyxt]]. I'll explain in a little more detail here.

   We pass Lisp code to the running Nyxt process via shell commands. This requires that ~REMOTE-EXECUTION-P~ must not be ~nil~ (in Nyxt). Once that is done, we can use the following functions to pass arbitrary Lisp code:

   #+BEGIN_SRC emacs-lisp :tangle no
     (defun format-for-nyxt-eval (list)  (shell-quote-argument (format "%S" list))) ;; prepare lisp code to be passed to the shell
     (defun eval-in-nyxt (s-exps)  (call-process "nyxt" nil nil nil (concat "--remote --eval " (format-for-nyxt-eval s-exps))))
   #+END_SRC

   Now we can only do so by elisp code, to prevent mistakes. Now we can use it!

   #+BEGIN_SRC emacs-lisp :tangle no
     (defun set-in-nyxt (variable elisp) (eval-in-nyxt `(setq ,variable (list ,@elisp))))
     (defun eval-region-in-nyxt (start end) (interactive "r") (eval-in-nyxt (read (buffer-substring start end))))
   #+END_SRC

   And if we happen to have the following in our init file for Nyxt (usually in ~$HOME/.config/nyxt/init.lisp~)...

   #+BEGIN_SRC lisp
    
     (ql:quickload :cl-strings)
    
     (defun eval-in-emacs (&rest s-exps)
       "Evaluate S-EXPS with emacsclient."
       (let ((s-exps-string (cl-strings:replace-all
			     (write-to-string
			      `(progn ,@s-exps) :case :downcase)
			     ;; Discard the package prefix.
			     "nyxt::" "")))
	 (format *error-output* "Sending to Emacs:~%~a~%" s-exps-string)
	 (uiop:run-program
	  (list "emacsclient" "--eval" s-exps-string))))
   #+END_SRC

   (Taken directly from [[https://nyxt.atlas.engineer/article/emacs-hacks.org][here]]) then we can use the following function in Emacs:

   #+BEGIN_SRC emacs-lisp :tangle no
     (defun get-nyxt-buffers () (eval-in-nyxt
				 '(eval-in-emacs
				   `(setq nyxt-buffer-list
					  (list ,@(mapcar #'title (buffer-list)))))))
     (defun search-in-nyxt (search-term) (interactive "sSeach in Nyxt:") (eval-in-nyxt
									  `(buffer-load (make-instance 'new-url-query
												       :query ,search-term
												       :engine (first (last (search-engines (current-buffer))))))))
    
   #+END_SRC
** CANCELLED Stumpwm                                                     :wm:

   Let's be able to give commands to Stumpwm. Instead of doing this through slime or Sly, we can do it through ~stumpish~, a command shell for stumpwm. It's in the stumpwm contrib module. We save the path to it and make a function to run Lisp code in Stumpwm:

   #+BEGIN_SRC emacs-lisp :tangle no
     (setq stumpish-path "~/.stumpwm.d/modules/util/stumpish/stumpish")
     (defun eval-in-stumpwm (s-exps) (call-process stumpish-path nil nil nil (format "eval %S" s-exps)))
     (defun eval-in-stumpwm-and-return (s-exps) (read (shell-command-to-string (concat
										stumpish-path " eval "
										(shell-quote-argument (format "%S" s-exps))))))
     (defun eval-region-in-stumpwm (start end) (interactive "r") (eval-in-stumpwm (read (buffer-substring start end))))
   #+END_SRC

   We would also like to be able to pass ELisp to Emacs from Stumpwm:

   #+BEGIN_SRC lisp
     (defun stumpwm-eval-in-emacs (s-exps)
       (run-shell-command (concatenate 'string "emacsclient --eval '" (write-to-string s-exps :case :downcase) "'")))
   #+END_SRC
     
     
     
     And now we're ready to write some helpful interaction commands!

*** CANCELLED Write major mode for editing a buffer for window manager interaction (dired/org-style)

    First we collect the window tree from stumpwm:

    #+BEGIN_SRC emacs-lisp :tangle no
      
      (defun get-stumpwm-desktop () (eval-in-stumpwm-and-return
				     '(progn
					(dump-desktop-to-file "~/.stumpwm.d/.desktop")
					())))
      
      
      
      (defun make-desktop-to-buffer ()
	(let (( window-tree (get-stumpwm-desktop)))
	  '()
	  )) ;;finish
    #+END_SRC

    I am running into some problems with this... Stumpwm doesn't expose enough useful functions to get a full desktop tree. Accessor functions are hidden, slot values as well... Not sure what the solution is. (Maybe try SLIME ?)

    <2021-11-15 Mon> Checking in on this after a while... I'm not using stumpwm so gave up.

