index.html
<div id="outline-container-org69d4ef7" class="outline-3">
<h3 id="org69d4ef7"><span class="done CANCELLED">CANCELLED</span> Nyxt Integration&#xa0;&#xa0;&#xa0;<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-org69d4ef7">
<p>
Here we provide a couple of helper functions for interacting with <a href="https://nyxt.atlas.engineer">Nyxt</a>. I'll explain in a little more detail here.
</p>

<p>
We pass Lisp code to the running Nyxt process via shell commands. This requires that <code>REMOTE-EXECUTION-P</code> must not be <code>nil</code> (in Nyxt). Once that is done, we can use the following functions to pass arbitrary Lisp code:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">format-for-nyxt-eval</span> (list)  (shell-quote-argument (format <span style="color: #f1fa8c;">"%S"</span> list))) <span style="color: #6272a4;">;; </span><span style="color: #a8a8a8;">prepare lisp code to be passed to the shell</span>
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">eval-in-nyxt</span> (s-exps)  (call-process <span style="color: #f1fa8c;">"nyxt"</span> nil nil nil (concat <span style="color: #f1fa8c;">"--remote --eval "</span> (format-for-nyxt-eval s-exps))))
</pre>
</div>

<p>
Now we can only do so by elisp code, to prevent mistakes. Now we can use it!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">set-in-nyxt</span> (variable elisp) (eval-in-nyxt `(<span style="color: #ff79c6; font-weight: bold;">setq</span> ,variable (list ,@elisp))))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">eval-region-in-nyxt</span> (start end) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"r"</span>) (eval-in-nyxt (read (buffer-substring start end))))
</pre>
</div>

<p>
And if we happen to have the following in our init file for Nyxt (usually in <code>$HOME/.config/nyxt/init.lisp</code>)&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(ql:quickload <span style="color: #8be9fd; font-style: italic;">:cl-strings</span>)

(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">eval-in-emacs</span> (<span style="color: #6ae4b9; font-style: italic;">&amp;rest</span> s-exps)
  <span style="color: #6272a4;">"Evaluate S-EXPS with emacsclient."</span>
  (<span style="color: #ff79c6; font-weight: bold;">let</span> ((s-exps-string (cl-strings:replace-all
                        (write-to-string
                         `(<span style="color: #ff79c6; font-weight: bold;">progn</span> ,@s-exps) <span style="color: #8be9fd; font-style: italic;">:case</span> <span style="color: #8be9fd; font-style: italic;">:downcase</span>)
                        <span style="color: #6272a4;">;; </span><span style="color: #a8a8a8;">Discard the package prefix.</span>
                        <span style="color: #f1fa8c;">"nyxt::"</span> <span style="color: #f1fa8c;">""</span>)))
    (format *error-output* <span style="color: #f1fa8c;">"Sending to Emacs:~%~a~%"</span> s-exps-string)
    (uiop:run-program
     (list <span style="color: #f1fa8c;">"emacsclient"</span> <span style="color: #f1fa8c;">"--eval"</span> s-exps-string))))
</pre>
</div>

<p>
(Taken directly from <a href="https://nyxt.atlas.engineer/article/emacs-hacks.org">here</a>) then we can use the following function in Emacs:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">get-nyxt-buffers</span> () (eval-in-nyxt
                            '(eval-in-emacs
                              `(<span style="color: #ff79c6; font-weight: bold;">setq</span> nyxt-buffer-list
                                     (list ,@(mapcar #'title (buffer-list)))))))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">search-in-nyxt</span> (search-term) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"sSeach in Nyxt:"</span>) (eval-in-nyxt
                                                                     `(buffer-load (make-instance 'new-url-query
                                                                                                  <span style="color: #8be9fd; font-style: italic;">:query</span> ,search-term
                                                                                                  <span style="color: #8be9fd; font-style: italic;">:engine</span> (first (last (search-engines (current-buffer))))))))

</pre>
</div>
</div>
</div>
<div id="outline-container-org1cdfc56" class="outline-3">
<h3 id="org1cdfc56"><span class="done CANCELLED">CANCELLED</span> Stumpwm&#xa0;&#xa0;&#xa0;<span class="tag"><span class="wm">wm</span></span></h3>
<div class="outline-text-3" id="text-org1cdfc56">
<p>
Let's be able to give commands to Stumpwm. Instead of doing this through slime or Sly, we can do it through <code>stumpish</code>, a command shell for stumpwm. It's in the stumpwm contrib module. We save the path to it and make a function to run Lisp code in Stumpwm:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">setq</span> stumpish-path <span style="color: #f1fa8c;">"~/.stumpwm.d/modules/util/stumpish/stumpish"</span>)
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">eval-in-stumpwm</span> (s-exps) (call-process stumpish-path nil nil nil (format <span style="color: #f1fa8c;">"eval %S"</span> s-exps)))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">eval-in-stumpwm-and-return</span> (s-exps) (read (shell-command-to-string (concat
                                                                           stumpish-path <span style="color: #f1fa8c;">" eval "</span>
                                                                           (shell-quote-argument (format <span style="color: #f1fa8c;">"%S"</span> s-exps))))))
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">eval-region-in-stumpwm</span> (start end) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"r"</span>) (eval-in-stumpwm (read (buffer-substring start end))))
</pre>
</div>

<p>
We would also like to be able to pass ELisp to Emacs from Stumpwm:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">stumpwm-eval-in-emacs</span> (s-exps)
  (run-shell-command (concatenate 'string <span style="color: #f1fa8c;">"emacsclient --eval '"</span> (write-to-string s-exps <span style="color: #8be9fd; font-style: italic;">:case</span> <span style="color: #8be9fd; font-style: italic;">:downcase</span>) <span style="color: #f1fa8c;">"'"</span>)))
</pre>
</div>



<p>
And now we're ready to write some helpful interaction commands!
</p>
</div>

<div id="outline-container-org6382725" class="outline-4">
<h4 id="org6382725"><span class="done CANCELLED">CANCELLED</span> Write major mode for editing a buffer for window manager interaction (dired/org-style)</h4>
<div class="outline-text-4" id="text-org6382725">
<p>
First we collect the window tree from stumpwm:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">get-stumpwm-desktop</span> () (eval-in-stumpwm-and-return
                               '(progn
                                  (dump-desktop-to-file <span style="color: #f1fa8c;">"~/.stumpwm.d/.desktop"</span>)
                                  ())))



(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">make-desktop-to-buffer</span> ()
  (<span style="color: #ff79c6; font-weight: bold;">let</span> (( window-tree (get-stumpwm-desktop)))
    '()
    )) <span style="color: #6272a4;">;;</span><span style="color: #a8a8a8;">finish</span>
</pre>
</div>

<p>
I am running into some problems with this&#x2026; Stumpwm doesn't expose enough useful functions to get a full desktop tree. Accessor functions are hidden, slot values as well&#x2026; Not sure what the solution is. (Maybe try SLIME ?)
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-11-15 Mon&gt; </span></span> Checking in on this after a while&#x2026; I'm not using stumpwm so gave up.
</p>
</div>
</div>
</div>
