index.org
** Elfeed                                                               :web:

Let's set up [[https://github.com/skeeto/elfeed][Elfeed]]!

#+BEGIN_src emacs-lisp
  (defun my-elfeed-settings () (interactive)
  (global-set-key (kbd "C-; e") 'elfeed)
  (setq elfeed-feeds
	'(("https://api.quantamagazine.org/feed/" science)
	  ("https://acoup.blog/feed" history)
	  ("https://www.bloomberg.com/opinion/authors/ARbTQlRLRjE/matthew-s-levine.rss" finance)
	  ("https://cvgmt.sns.it/papers/rss.xml" preprint)
	  ("https://planet.emacslife.com/atom.xml" emacs)
	  ("https://kbd.news/rss2.php" keyboard)
	  ("https://thealexandrian.net/feed" dnd)
	  ("https://theangrygm.com/feed/" dnd)
	  ("https://sachachua.com/blog/feed/" emacs)
	  )))
#+END_src

#+BEGIN_SRC emacs-lisp
  (use-package elfeed
  :config (my-elfeed-settings))
#+END_SRC


#+BEGIN_SRC emacs-lisp
;;  (use-package pdf-tools
;;    :config (pdf-tools-install))
#+END_SRC

** Wikipedia Search                                                     :web:

Let's search Wikipedia...

#+BEGIN_src emacs-lisp
  (defun wiki-search (search-term) (interactive "sSearch Wikipedia: ") (browse-url (concat "https://en.wikipedia.org/w/index.php?title=Special%3ASearch&search=" search-term)))
#+END_src

** Mu4e Settings                                                       :mail:

   First, update mail settings:

   #+BEGIN_SRC emacs-lisp
     (defun init-mail-settings () ()
       (setq
	mu4e-get-mail-command "offlineimap -q -o"
	mu4e-update-interval 30000))
   #+END_SRC

#+BEGIN_SRC emacs-lisp
     (use-package mu4e
       :load-path  "/usr/share/emacs/site-lisp/mu4e"
       :init (init-mail-settings))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-menu-item "m" 'mu4e)
  (add-hook 'mu4e-compose-hook 'turn-off-autofill)
#+END_SRC
  
* Resources
** Beginner and General Resources

  Here's a brief list of resources for reading on Emacs...

  - [[https://karthinks.com/software/batteries-included-with-emacs/][Built-in Emacs Features]]
  - [[https://karthinks.com/software/latex-input-for-impatient-scholars/][LaTeX Input]]
  - [[https://sheer.tj/the_way_of_emacs.html][The Way of Emacs]]
  - [[https://github.com/emacs-tw/awesome-emacs][Awesome Emacs GitHub]]
  - [[https://www.masteringemacs.org/][Mastering Emacs]]
  - [[https://sachachua.com/blog/2014/04/emacs-beginner-resources/][Sacha Chua's Beginner Resources]]
  - The keybindings (in Emacs, of course) ~C-h r~ and ~C-h i~

** Other's Configs

Here are some other well-developed configs I've found:

  - [[https://sachachua.com/dotemacs/][Sacha Chua's config]]
  - [[https://github.com/daviwil/emacs-from-scratch][Streamed Config]] A config built entirely on stream, so you can go and watch a video explanation of the config building process
  - [[https://emacs.metaphoric.dev/][Megumacs]] A config I found randomly on GitHub
  - [[https://protesilaos.com/emacs/dotemacs][Prot's config]] A config by an Emacs package writer
