index.html

<div id="outline-container-orgb89e54c" class="outline-3">
<h3 id="orgb89e54c">Elfeed&#xa0;&#xa0;&#xa0;<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-orgb89e54c">
<p>
Let's set up <a href="https://github.com/skeeto/elfeed">Elfeed</a>!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">my-elfeed-settings</span> () (<span style="color: #ff79c6; font-weight: bold;">interactive</span>)
(global-set-key (kbd <span style="color: #f1fa8c;">"C-; e"</span>) 'elfeed)
(<span style="color: #ff79c6; font-weight: bold;">setq</span> elfeed-feeds
      '((<span style="color: #f1fa8c;">"https://api.quantamagazine.org/feed/"</span> science)
        (<span style="color: #f1fa8c;">"https://acoup.blog/feed"</span> history)
        (<span style="color: #f1fa8c;">"https://www.bloomberg.com/opinion/authors/ARbTQlRLRjE/matthew-s-levine.rss"</span> finance)
        (<span style="color: #f1fa8c;">"https://cvgmt.sns.it/papers/rss.xml"</span> preprint)
        (<span style="color: #f1fa8c;">"https://planet.emacslife.com/atom.xml"</span> emacs)
        (<span style="color: #f1fa8c;">"https://kbd.news/rss2.php"</span> keyboard)
        (<span style="color: #f1fa8c;">"https://thealexandrian.net/feed"</span> dnd)
        (<span style="color: #f1fa8c;">"https://sachachua.com/blog/feed/"</span> emacs)
        )))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">elfeed</span>
<span style="color: #8be9fd; font-style: italic;">:config</span> (my-elfeed-settings))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">pdf-tools</span>
  <span style="color: #8be9fd; font-style: italic;">:config</span> (pdf-tools-install))
</pre>
</div>
</div>
</div>

<div id="outline-container-org01fea58" class="outline-3">
<h3 id="org01fea58">Wikipedia Search&#xa0;&#xa0;&#xa0;<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-org01fea58">
<p>
Let's search Wikipedia&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">wiki-search</span> (search-term) (<span style="color: #ff79c6; font-weight: bold;">interactive</span> <span style="color: #f1fa8c;">"sSearch Wikipedia: "</span>) (browse-url (concat <span style="color: #f1fa8c;">"https://en.wikipedia.org/w/index.php?title=Special%3ASearch&amp;search="</span> search-term)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org558a6ff" class="outline-3">
<h3 id="org558a6ff">Mu4e Settings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mail">mail</span></span></h3>
<div class="outline-text-3" id="text-org558a6ff">
<p>
First, update mail settings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">defun</span> <span style="color: #50fa7b; font-weight: bold;">init-mail-settings</span> () ()
  (<span style="color: #ff79c6; font-weight: bold;">setq</span>
   mu4e-get-mail-command <span style="color: #f1fa8c;">"offlineimap -q -o"</span>
   mu4e-update-interval 30000))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #ff79c6; font-weight: bold;">use-package</span> <span style="color: #bd93f9;">mu4e</span>
  <span style="color: #8be9fd; font-style: italic;">:load-path</span>  <span style="color: #f1fa8c;">"/usr/share/emacs/site-lisp/mu4e"</span>
  <span style="color: #8be9fd; font-style: italic;">:init</span> (init-mail-settings))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-menu-item <span style="color: #f1fa8c;">"m"</span> 'mu4e)
(add-hook 'mu4e-compose-hook 'turn-off-autofill)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd5bd8bf" class="outline-2">
<h2 id="orgd5bd8bf">Resources</h2>
<div class="outline-text-2" id="text-orgd5bd8bf">
</div>
<div id="outline-container-orge712fc3" class="outline-3">
<h3 id="orge712fc3">Beginner and General Resources</h3>
<div class="outline-text-3" id="text-orge712fc3">
<p>
Here's a brief list of resources for reading on Emacs&#x2026;
</p>

<ul class="org-ul">
<li><a href="https://karthinks.com/software/batteries-included-with-emacs/">Built-in Emacs Features</a></li>
<li><a href="https://karthinks.com/software/latex-input-for-impatient-scholars/">LaTeX Input</a></li>
<li><a href="https://sheer.tj/the_way_of_emacs.html">The Way of Emacs</a></li>
<li><a href="https://github.com/emacs-tw/awesome-emacs">Awesome Emacs GitHub</a></li>
<li><a href="https://www.masteringemacs.org/">Mastering Emacs</a></li>
<li><a href="https://sachachua.com/blog/2014/04/emacs-beginner-resources/">Sacha Chua's Beginner Resources</a></li>
<li>The keybindings (in Emacs, of course) <code>C-h r</code> and <code>C-h i</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgf4dbe99" class="outline-3">
<h3 id="orgf4dbe99">Other's Configs</h3>
<div class="outline-text-3" id="text-orgf4dbe99">
<p>
Here are some other well-developed configs I've found:
</p>

<ul class="org-ul">
<li><a href="https://sachachua.com/dotemacs/">Sacha Chua's config</a></li>
<li><a href="https://github.com/daviwil/emacs-from-scratch">Streamed Config</a> A config built entirely on stream, so you can go and watch a video explanation of the config building process</li>
<li><a href="https://emacs.metaphoric.dev/">Megumacs</a> A config I found randomly on GitHub</li>
<li><a href="https://protesilaos.com/emacs/dotemacs">Prot's config</a> A config by an Emacs package writer</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Wallace</p>
<p class="date">Created: 2022-06-17 Fri 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
